/*HW04.task06; Решение задачи А14. "Максимальная цифра"
 * Дано трехзначное число, напечатать макисмальную цифру.*/
#include <stdio.h>

int main (void)
{
   int a[4];

   scanf("%d", &a[4]);
   a[1] = a[4]/100;
   a[2] = (a[4]/10)%10;
   a[3] = (a[4]%100)%10;
   if (a[2] > a[1])
   {
      a[1] = a[2];
   }
   if (a[3] > a[1])
   {
      a[1] = a[3];
   }
   printf("%d", a[1]);
   return 0;
}
